## Essentials
brew "git"
brew "hub"
brew "tmux"
brew "reattach-to-user-namespace", args: ['with-wrap-launchctl', 'with-wrap-pbcopy-and-pbpaste']
brew "mercurial"
brew "python3"
brew "ruby", args: ['with-doc']
brew "ruby-build"
brew "rbenv"
brew "rbenv-ctags"

tap "homebrew/science"
brew "R"

## Better CLI
brew "autojump"
brew "zsh"
brew "zsh-completions"
# brew "z"
brew "watch"
brew "colordiff"
brew "automake"
brew "autoconf"
# brew "mosh"
brew "coreutils"
brew "findutils"
brew "osxutils"
brew "most"
brew "tree"

### Completions
brew "brew-cask-completion"
brew "bundler-completion"
brew "gem-completion"
brew "ruby-completion"
brew "rake-completion"
brew "rails-completion"
brew "pip-completion"
brew "launchctl-completion"
brew "docker-completion"
brew "docker-compose-completion"
brew "vagrant-completion"

## Tools
### General / Misc
brew "wget"
brew "curl", args: ['with-openssl']
brew "googler"
brew "dos2unix"
brew "ssh-copy-id"
brew "ossp-uuid"
brew "pidof"
brew "htop"
brew "pandoc"
brew "pandoc-crossref"
brew "pandoc-citeproc"
brew "heroku"
brew "sshrc"
brew "wifi-password"
brew "smartmontools"
brew "sleepwatcher"
brew "v8"

# brew "cadaver"
brew "editorconfig"
brew "fdupes"
# brew "openssl"
# brew "openvpn"

## Better vim
brew "ack"
brew "the_silver_searcher"
brew "fzf"
brew "vim", args: ['with-override-system-vi', 'with-client-server']
brew "ctags"
brew "cscope"

### Mutt
brew "kevwil/patches/mutt" # with trash patch
brew "abook"
brew "lbdb"
brew "isync"
brew "notmuch"
brew "urlview"

### Image tools
brew "ghostscript"
brew "imagemagick"
