brew "ack"
brew "autojump"
brew "caskroom/cask/brew-cask"
brew "fluid-synth"
brew "homebrew/fuse/fuse4x"
brew "ghostscript"
brew "git"
#brew "gzrt"
brew "hub"
brew "imagemagick"
brew "homebrew/dupes/libiconv"
#brew "libksba"
#brew "lynx"
#brew "mercurial"
brew "mplayer"
brew "kevwil/patches/mutt" # with trash patch
brew "mysql"
#brew "neovim/neovim/neovim"
brew "node"
brew "ossp-uuid"
brew "pianobar"
brew "pidof"
#brew "postgresql"
brew "python"
brew "python3"
brew "qt"
brew "rbenv"
brew "ruby"
brew "ruby-build"
brew "ssh-copy-id"
#brew "v8"
brew "watch"
brew "wget"
brew "zsh"
brew "zsh-completions"
